import mymodule as md
html_ds_ss = [
    [
        {
            'title': 'Milano - Italy',
            'time': '12.02.2020',
            'data': [
                '1.70',
                '6.50',
                '2.40'
            ]
        },

        {
            'title': 'Milano - Italy',
            'time': '12.02.2020',
            'data': [
                '2.10',
                '3.60',
                '3.00'
            ]
        }
    ],
    [
        {
            'title': 'Milano - Roma',
            'time': '12.02.2020',
            'data': [
                '1.70',
                '6.50',
                '2.40'
            ]
        },

        {
            'title': 'Milano - Roma',
            'time': '12.02.2020',
            'data': [
                '2.10',
                '3.60',
                '3.00'
            ]
        }
    ]
]

common_data = [
# EVENT 1
    [
        {
            'title': 'Хоффенхайм — Вольфсбург',
            'time': '12.02.2020',
            'data': [
                '1.70',
                '6.50',
                '2.40'
            ]
        },

        {
            'title': 'Хоффенхайм — Вольфсбург',
            'time': '12.02.2020',
            'data': [
                '2.10',
                '3.60',
                '3.00'
            ]
        }
    ],
# EVENT 2
    [
        {
            'title': 'Аугсбург — Фрайбург',
            'time': '12.02.2020',
            'data': [
                '2.10',
                '3.60',
                '3.40'
            ]
        },

        {
            'title': 'Аугсбург — Фрайбург',
            'time': '12.02.2020',
            'data': [
                '2.10',
                '3.60',
                '3.40'
            ]
        }
    ],
# EVENT 3
    [
        {
            'title': 'Лейпциг — Вердер',
            'time': '12.02.2020',
            'data': [
                '1.27',
                '6.00',
                '11.00'
            ]
        },

        {
            'title': 'Лейпциг — Вердер',
            'time': '12.02.2020',
            'data': [
                '1.27',
                '6.00',
                '11.00'
            ]
        }
    ],
# EVENT 4
[
        {
            'title': 'Падерборн — Герта',
            'time': '12.02.2020',
            'data': [
                '2.85',
                '3.60',
                '2.40'
            ]
        },

        {
            'title': 'Падерборн — Герта',
            'time': '12.02.2020',
            'data': [
                '2.85',
                '3.60',
                '2.40'
            ]
        }
    ]
]

a = md.check_fork(common_data)
print(a)
